
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 12 to change, 2 to destroy.</code></pre>

* Create
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;statement_timeout&#34;]
* Update
  * module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/d1a56e4a74b94b5f9d19f4216ad5a822" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/d1a56e4a74b94b5f9d19f4216ad5a822" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "d1a56e4a74b94b5f9d19f4216ad5a822" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/7d652c70ddc146e7ad45a86a224fb69f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/7d652c70ddc146e7ad45a86a224fb69f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "7d652c70ddc146e7ad45a86a224fb69f" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support"
        name                = "cft-task-postgres-db-flexible-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-aat"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-aat"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-aat"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-aat"
        name                              = "cft-task-postgres-db-flexible-aat"
      ~ tags                              = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["statement_timeout"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "statement_timeout"
      + server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-aat"
      + value     = "60000"
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat"
        name       = "cft-task-postgres-db-flexible-data-aat"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "db-alerts-action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support"
        name                = "cft-task-postgres-db-flexible-wa-support"
      ~ tags                = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_cpu_percent_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_memory_percent_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-replica-aat"
        name                     = "db_storage_utilization_cft-task-postgres-db-flexible-replica-aat"
      ~ tags                     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-aat"
        name                              = "cft-task-postgres-db-flexible-replica-aat"
      ~ tags                              = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat"
        name       = "cft-task-postgres-db-flexible-replica-data-aat"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-06-05T15:54:47Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 12 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1441,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->